# Path Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileExportingEventArgs..::..Path Property
FileExportingEventArgs Class See Also
---
The target path for the export.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public string Path { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Path As String
	Get
```

Visual C++
---
```text
public:
property String^ Path {
	String^ get ();
}
```

# Remarks
When several files are exported at the same time, 'Path' property will just report the directory instead of those full file names.
# See Also
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace